<img src="../img/banniere_sql.png" alt="banner_sql" width="800"/>

# Application de requêtes SQL vers la BDD

### Imports

In [ ]:
from sqlalchemy import create_engine
import pandas as pd
import os
from dotenv import load_dotenv

### Connexion BDD

In [2]:
load_dotenv()

DB_URL = os.getenv("DB_URL")
engine = create_engine(DB_URL)

### Exemples de requêtes

Nombre de livres total

In [3]:
query = "SELECT COUNT(*) FROM books;"
pd.read_sql_query(query, engine)

   count
0   1000

Prix moyen des livres

In [7]:
query2 = "SELECT AVG(price) AS avg_price FROM stocks;"
pd.read_sql_query(query2, engine)

   avg_price
0   35.07035

Top 5 des catégories par nombre de livres

In [11]:
query3 = """
    SELECT categories.name as category, COUNT(*) AS nb
    FROM books
    JOIN categories ON categories.id = books.category_id
    GROUP BY category
    ORDER BY nb DESC
    LIMIT 5;
    """

pd.read_sql_query(query3, engine)

         category   nb
0         Default  152
1      Nonfiction  110
2  Sequential Art   75
3   Add a comment   67
4         Fiction   65

Top 10 des livres les mieux notés avec catégorie associée

In [ ]:
query4 = """
    SELECT title, categories.name as category, rating
    FROM books
    JOIN categories ON categories.id = books.category_id 
    ORDER BY rating DESC
    LIMIT 10;
    """

pd.read_sql_query(query4, engine)

                                               title        category  rating
0                                         Black Dust         Romance       5
1              Sapiens: A Brief History of Humankind         History       5
2                                  The Elephant Tree        Thriller       5
3  Worlds Elsewhere: Journeys Around Shakespeare’...      Nonfiction       5
4                          Rip it Up and Start Again           Music       5
5  Scott Pilgrim's Precious Little Life (Scott Pi...  Sequential Art       5
6                                        Set Me Free     Young Adult       5
7                                     Sophie's World      Philosophy       5
8  The Four Agreements: A Practical Guide to Pers...    Spirituality       5
9                                             Thirst         Fiction       5

Titre et prix du livre le moins cher

In [22]:
query5 = """
    SELECT books.title, stocks.price
    FROM books
    JOIN stocks ON books.id = stocks.book_id
    ORDER BY stocks.price ASC
    LIMIT 1;
    """

pd.read_sql_query(query5, engine)

                        title  price
0  An Abundance of Katherines   10.0

Nombre de livres total dans le stock

In [23]:
query6 = """ 
    SELECT SUM(stock_count) FROM stocks;
    """

pd.read_sql_query(query6, engine)

    sum
0  8585